{"id": "d94d3e63-e90d-5a4f-90dc-0e5490b82f3d", "fandoms": ["Teen Wolf", "Twilight"], "pair": ["- DreamerCarroll15. Thanks for the follows and favs on this fanfic. And thanks for following me and favoriting me. :) enjoy this chapter. Sorry for spelling errors. Chapter 12 - Choices. \"Moxie! Moxie I\"m back! Where are you?\" Carol\"s voice rings from downstairs. Gasping I sit up and slap Isaac. \"Issac.. Issac get up! Carol\"s home from Grandma\"s!\" \"Be up in a minute Derek\" he mumbles. We\"d been together since Carol left to go see Grandma with Christy the other night. Grandma doesn\"t like me reminding me of her dead daughter and doesn\"t like the idea that she got pregnant at fourteen. Knowing its no use I quickly pull on a shirt and shorts and tie up my messy hair. I run down the stairs to Carol and Christy. \"Oh my god I missed you\" I say as I turn towards them and hug them tight. \"Oh we missed you too Moxie.. Wow did you sleep all weekend long?\" \"Kinda\" \"Well okay.. I\"m going to make breakfast. Want some? Were straving arnt we Christy honey?\" Christy smiles and nods. \"I\"m going to watch Ed Edd N Eddy!\" She exclaims as she runs into the kitchen. \"I was talking to Derek on the phone last night\" \"Really?\" I ask not sure to be supprised at the fact that Carol had Derek\"s number, Carol used her phone, or that they were talking in the first place. \"Look Moxie, if you and Issac are serious.. Use protection. I hope you did anyway\" \"H-\" \"You smell like it.. Take a shower and change the sheets.. Your washing them\" \"Oh god Carol I\"m sorry\" She sighs. \"We were young once I suppose\" she mutters as she walks into the kitchen. I run up the stairs to my bathroom. Issac still sleeping, snoring softly. Closing the door I strip down and get into the warm shower. \"Your trying to make me hard\" I laugh as I walk over to my drawers for nothing more than my drawers, wrapped in a towel. \"Its a nice look for you.. Wet.. Liking it\" \"I\"d love to stay and play with you but I\"ve got to get up. You should shower. You sink\" \"Wanna get one with me?\" He asks as I quickly put on my underwear and bra and then using the towel to dry my hair. I walk over to him. \"Gosh I want to but we couldn\"t be doing much cleaning would we?\" He winks. \"So you do have dino undies\" \"What?\" \"From that P.E class.. You do own Dino undies\" I smile hiding the pain in my heart as Jackson crosses my mind once more. Guilt suddenly fills my stomach again. I through on my jeans and a black t-shirt that says F.I.S.H. \"Moxie what\"s up?\" He asks as he gets out of bed, only in his boxers. I didn\"t even notice the tears on my face. \"You\"ll hate me\" \"How could I hate you?\" \"But.. But you will\" \"I won\"t\" \"Promise?\" \"I promise\" I take in a deep breath and wipe my eyes. \"Friday night when I was helping Scott and Stiles Jackson kissed me\" He\"s silent as he takes in this information. \"It didn\"t mean anything Issac I swear.. He kissed me and I couldn\"t stop him\" \"Why couldnt you?\" He voice is shaky. I wrap my arms around him tight. \"I don\"t know... He looked so heartbroken, so sad..\" Issac growls in my ear. I step back and look into his glowing eyes. \"Issac don\"t its not worth it.. I don\"t love him.. I love you! I wouldn\"t have been here with you if I didn\"t\" \"Maybe if you love me so much you wouldn\"t have done it\" \"Ya know what? Act this way! Were over anyway!\" He growls again and turns his back on me and walks into my bathroom, leaving me to greif with my mistake. Damn why did I have to tell him?! Why did I have to let Jackson kiss me?! What am I after doing?! I push the plate away from me. \"Your not hungry?\" \"No\" I mumble. \"I feel sick\" \"Maybe from the lack of food in your system\" Closing my eyes I can feel my stomach heaving. I rush from the table and to the downstairs bathroom under the stairs. After I\"ve finished emptying my stomach I brush my teeth and slowly make my way up the stairs. \"Your going to be okay right Moxie?\" Carol asks me from the end of the stairs. \"Yeah just need to nap\" \"Right.. Will I call you for dinner later?\" \"Yeah okay\" Slowly I make my way to the linen closet and grab a fresh bed sheet and wrap it around me and walk into my room. Kicking the other sheets off with my foot I listen to the stillness in the room before grabing my book from my drawer in my nightstand. I lay on the bed, wrapped in the clean sheets and flip through it. Sickness. Sickness. Sickness. I mutter. I land on the page and look down the lists. I stop at one underlined in blue pen. Pregnacy. I flick to the page and read the contents quickly, sitting up in shock. My jaw drops. When a witch has unprotected sex, even for the first time, with her mate she instantly becomes pregnant. I snap the book shut and throw it on the bedside table. I cant be pregnant. That doesn\"t make any sense. Oh no. I don\"t even remember using any protection. Growling at my stupidity I reach for the book again and go back to the list. None of the other listed sicknesses have nothing with my symtoms other than the plage, cursed warts and vemon bites and I know I have none of those sicknesses. I read on the contains under pregnancy. When the witch gets pregnant with her mate the pregnancy will start right away kick starting into the sickness in the morning and then slowly down after the second month. There\"s only one way I can know for real instead of reading it. Feeling better I grab my purse and my jacket. \"Be back soon Carol\" I say as I run out the door and to the pharmcy. I look down at the plus sign on the white stick as I sit on the sink in the women\"s bathroom at the pharmcy. What now? Do I tell someone? I\"m going to have to tell Carol. Do I really want a baby? How can I manage to keep a small child from harm? Should I talk with someone about it? I can\"t go to Allison because she\"s gone off the charts, Stiles won\"t answer his phone, Isaac will defendly tell me to go to Jackson about it. There\"s only Scott left. I\"m defendly not talking to Lydia about it even though she\"s the most sanest of us now. Dialling his number I hold up the stick again, hoping it was a mistake and that it would change into negative. \"Hey Mox, what\"s up? What\"d you do all weekend?\" \"Hey Scott. Ehh I need advice\" \"Advice on what?\" I pause before sighing. \"On me having a kid\" A crashing noise fills my right hear. I hiss in pain and hold the phone to my left ear. \"The fuck man.. What was that?\" \"I dropped the phone sorry, I didn\"t hear you right.. Are you telling me your pregnant?\" \"Yeah\" He\"s stuttering on the phone before he can calm down. \"Okay so its not mine...\" He starts. \"Really Scott? Really?\" I ask sarcasicly. \"What are you going to do? What does Isaac think you should do?\" \"I don\"t know, maybe tell me to go to Jackson about it. Were are you anyway?\" \"At work, why what happened between you two?\" \"Its best not to talk about it over the phone\" \"So what do you think?\" I ask as I pick up the sick pup about 8 weeks old I was playing with last time. I sit up on the counter by the sink and start to cuddle him agaisnt my chest, kissing him gently on the nose. He licks his nose and nestles deeper into my chest. \"I think you should still talk to Isaac about it\" \"Like that\"ll make a difference\" \"May I intervene? He is the father Moxie, he has a choice on this matter too\" I sigh. \"Yeah but... He won\"t care\" \"He\"ll start to notice Moxie, when your showing he\"ll ask you. He won\"t walk away from this Moxie, I wouldn\"t if it was Allison\" \"I\"ll tell him when the time is right\" I decide. \"Make it quick Moxie, pregnant Witches babies develop more rapidly than humans do\" I sigh. The pup in my arms starts to cower. \"What\"s wrong sweetness?\" I ask him as I lean in closer to him. The rest of the animals begin to howl, bark and hiss. Decan and Scott walk out of the office and try to comfort the poor pup. \"Its okay Isaac, were open\" I hear Decan say. I sigh and lean my head agaisnt the wall. Isaac leans over the dog on the table while Decan and Scott go back to helping the animal. \"Why does it smell like that?\" Decan and Scott chuckle smiling. I look confused but remember from my book that Werewolfs can tell the difference between a sick dog and a healthy dog. \"What?\" \"Scott said the same to me a few months ago, one day he could smell the difference between which animals were getting better and which were not\" \"He\"s not getting better is he?\" Decan shakes his head. \"Is it cancer?\" Isaac asks. \"Osteo sarcoma, has a very distint scent doesn\"t it?\" Scott nods and I continue to cuddle the small sick pup in my lap. \"Come here\" Isaac comes close to Decan, his gaze switches from the dog from Decan to me. I look down unable to meet his gaze. What if he knew? \"I know your aware of what your new abities can do for you, improved strength, speed and healing. Ever wonder what it could do for others?\" I look up confused. What did he mean what it could do for others? \"Give me your hand\" Decan holds out his hand and Isaac takes it slowly, unsure if its a good thing or a bad thing. \"Go on\" I watch as Decan places Isaac\"s hand on the dog. Decan pulls away slowly while Isaac holds on. The dogs breathing becomes quicker, more healthier. \"What did I do?\" He asks softly. \"You took some of his pain away\" \"Only a little bit but sometimes a little can make a difference\" I watch as Isaac tears up. He laughs softly and smiles, flashing his white straight teeth. I only hope he takes my news that well. \"That\"s amazing\" Isaac turns around to me. His gaze only on the pup in my lap. \"What\"s wrong with him?\" He asks. \"Right Scott let\"s get him back\" Decan says as together him and Scott bring the now healthier dog back with the rest of the animals. Isaac kneels infront of me. His face inches from mine. \"She\"s got worms\" He reaches out to the pup and I look down and watch strange black liquid pass from the pup to into his veins and up his arm. The pup lifts his head and licks my hand. I smile down at the pup and scratch behind his ear. I chuckle slightly along with Isaac, who has tears in his eyes. I pause and look at him. He looks up at me. I shake my head and smile. Later I decide much later. I lean agaisnt the wall outside and listen in to Scott and Isaac\"s conversation. The won\"t talk about anything infront of me. \"So why\"re you telling me?\" Scott asks. \"I\"m not telling you I\"m asking you, I\"m asking you for advice\" \"Your not the first. But from me? Why?\" \"Because I trust you\" \"Why?\" \"Cause you always seem to know the right thing to do\" Are they talking about me? Did Scott tell him? Oh I\"ll kill him. \"I usually have no idea what I\"m doing. I never know what I\"m doing\" Someone scoffs. \"Do you wanna let me know what your doing right now?\" \"I\"m not going anywhere if that\"s what you mean, I have too many people that need me\" \"Well I guess that makes me lucky cause I have no one so...\" \"What about Mox?\" \"Moxie\" he pauses as he says my name. \"She\"s got a whole future ahead of her, she\"s going to be a fornestic scientist. I\"m just holding her back. I want to run out and tell him. I won\"t be able to do any of that. Not with his kid needing me every second of every day. I already feel tears pricking my eyes. I hear footsteps come forward. \"Are you going to go with them?\" \"Yeah, yeah, I think I will\" I have to hold a sniffle as Isaac came closer. \"What about Mox? What are you going to tell her?\" \"She\"s be fine, she doesn\"t need me, she\"s the one that broke it off\" \"Don\"t you guys love each other?\" \"I did, still do, she just doesn\"t love me the way I want her to\" I want to cry and slam my fist into the door. My heart hurts. I didn\"t want this. I was mad. Stupid. I didn\"t want to break it off. I didn\"t mean to. \"Which is?\" Scott asks. Isaac sighs. \"She\"s meant to be my mate, I picked her to be my mate at the very start in that chemistry class. When me and Erica were trying to kill Lydia. She\"s not meant to be Jackson\"s\" There\"s a silence. I\"m not Jackson\"s mate. For god sake it was one kiss! But that one kiss meant something. I think back to that chemistry class and the way he sat beside me. The way I was able to know it was him by his black leather jacket. The one I was wearing now, ready for Scott to bring me home. \"Good luck with the game\" Isaac says. \"Thanks but I\"m not going ethier. I don\"t think I can play some meaningless game right now\" \"You weren\"t at practice last week were you?\" \"No I skiped it why?\" \"I thought you heard?\" \"Hear what?\" Decan comes up to me from the animals with a file. \"Would you put this on Vicky\"s desk? I need to get back to Oscar\" I nod and watch him go back to the dog. I through the file on Vicky\"s front desk. I hear footsteps come by me and stop. I look up and lock eyes with him. His eyes dart to his jacket and back to me. \"Your wearing my jacket\" \"Do you want it back\" \"You keep it\" With that said he walks out leaving me alone. The words build up on my tongue. I can\"t stop myself from running after him. Down the dark alley. He stops and turns around to face me. The words stick in my mouth. \"I\"m sorry.. I don\"t know how it happened. I just have had some protection on me\" I manage to say. He shakes his head. \"If your happy, that\"s all that counts\" He turns around and walks away. If your happy that\"s all that counts? What the hell is he on about? \"Hey Finstock\" I say as I walk into the boys changing rooms. \"Mars you shouldn\"t be in here\" \"Am I not allowed to say good luck to my school team?\" \"Whatever.. Anyway today we celebrate our independence day!\" The boys all go wild. \"Is that from that movie..\" \"Yeah\" Stiles says as he walks towards me smiling. \"Oh mo. Dia! Stiles is alive!\" (Oh my god) I say smiling. \"Who said otherwise?\" \"You just havnt been picking up\" \"Sorry\" \"Its okay.. Hey Ms McCall\" I say as I notice her there behind Stiles. \"Hey Moxie, your watching the game too?\" \"Yeah cause couch won\"t let me play.. Hell I\"m not allowed to be in here anymore\" \"Why?\" \"I uh.. Kinda broke up the boys locker room\" I say remembering Stiles telling me why I had to go to detention that day. \"Well spoken couch\" we hear Gerard say. We all look over at him, smiling beside Finstock. \"ahh priest!\" I yell only to receive confused looks and raised eyebrows. \"Really no one knows about that?\" \"What are you talking about?\" Stiles asks. \"I may have chosen something spoken with a little historical value but there\"s no dening your passion..\" \"Hoe\" I mumble. Stiles pinches me and I punch him back. He grits his teeth and I gently patt his shoulder smiling. \"... Don\"t think I\"ll be content with you just beating this team. Get out there and murder them\" My jaw drops open. So this is it? Gerard wants the team to kill everyone on the field? \"Get your asses on the field!\" Finstock yells. \"I will\" \"Not you Mars!\" \"Damn!\" I sit down beside Ms McCall and the Sheirf. \"Hey guys how\"s it going\" \"Hey Moxie you cheering on the guys?\" Sheirf asks. \"Wouldn\"t be a game without me, hey is that Stiles?\" I ask as he runs out on the field. \"Oh no why is my son on the field?\" \"Because he\"s on the team?\" \"He is. My son is on the field\" He stands up and yells. \"My son is on the field!\" \"Pray to god we don\"t loose!\" I yell standing up beside him. Lydia comes up and sits beside me. \"Got to go\" I say and quickly make my way to the bench where Scott is. \"Hey you okay?\" \"Yeah\" \"Gerard made Finstock put you on the bench?\" \"You guessed it\" Isaac comes and sits down beside us. \"You came to help?\" \"I came to win\" \"Give em hell\" I say smiling. He smiles back at me, nearly causing me to fall off the bench with shock. He looks down the field and the smile disapears. I follow his gaze and look at Gerard. \"Bastard\" I mumble. \"You got a plan yet?\" Isaac asks. \"Uh.. Right now its keep Jackson from killing anyone\" \"Well that might be easier if you were in the game. Scott sighs. \"We have to make it like couch won\"t have no choice but to play you\" \"How do we do that? He has a bench full of guys he uses before he puts me on the field\" \"Got it\" I say clicking my fingers. \"What is it?\" Scott asks. \"Isaac take out those guys but leave Murphy to me. We don\"t want couch to think your doing this only to get Scott on the field\" \"Right but why Murphy?\" \"He\"s the cutest there and I heard he liked my accent\" I say shrugging. \"Nothing will happen, I\"ll freeze him in the parking lott and use a memory loss spell on him after\" \"Do it\" Scott says nodding at me. I get up and walk over to the bench. I look at the guy beside Murphy and nod. He moves and I sit beside Murphy smiling. \"I need to talk to you alone\" I whisper in his ear. Supprised I\"m even talking to him he blushes and smiles at me. \"Bye couch\" I say as I grab his hand and run off. Couch yells insults and threatens to take him off the team. \"Moxie, I don\"t want to get kicked off the team\" \"Ah don\"t mind him Murphy, you won\"t get kicked off\" \"So what do you wanna talk about?\" Good I feel sorry for him. He\"s such a nice lad. \"Your really sweet Murphy. I\"m sorry\" He raises an eyebrow and I rest my palm on his chest and uses the knock out spell. He falls on the ground behind him. I look around the empty parking lott and kneel down and toutch Murphy\"s forehead and use the memory loss spell. I run back to the game. I pass Finstock as I run back to Scott, who now sits alone. \"Where\"s Murphy?\" \"Mom needed a lift some place\" I say pausing for a second before running to Scott. \"Where..\" \"Number 14\" I sit down and watch as there\"s bumping and pushes on the field. Number 14 goes down. \"Shit\" I say as me and Scott go over to his side. \"Its not broken but I can\"t move it\" \"Could Jackson have just paralyzed you without us seeing?\" \"I don\"t know\" Scott says doubtful. \"I think so, I feel it spreading\" The streaker comes along and paramedics start lifting Isaac on. Couch comes up beside us. \"McCall your in or we forfit\" he says as he hands or more like shoves the helmet into Scott\"s hands. \"Okay\" \"Mars off the field\" \"Yeah, yeah, yeah\" I say and walk back to the bench. Quickly we run to the guys locker room. Isaac leans agaisnt the sinks. Gerard and two of his lackies face him. A sword in Gerard hands. A smile builds on Isaac\"s face. \"Hey! That\"s my mate your messing with\" They turn around to face us. \"Moxie Mars, how nice to see your face again, or should I say Anna\"s?\" \"Fuck off! My ma has nothing to do with this!\" \"But doesn\"t she?\" \"What?\" \"Do you know why your mother fled beacon hills back then?\" \"Shut up\" \"Kate wanted Derek, but Derek wanted her best friend, Anna. Kate threatened Anna and Anna left. Then when you were born she stabbed your mother through the heart\" \"Shut up! That never happened! My ma died in childbirth\" \"Why don\"t you ask Carol, or Frankie your grandmother.. She\"d know\" he says smiling. I run for him but one of his lackies stops me. Scott lundges for another one. I flip the lackie on the ground and stand on his leg, hearing the deadly snap. I look for Gerard but he isn\"t around and nethier is Scott. \"Moxie, you okay?\" I bite my lip and fight fresh tears. \"Let\"s get out there\" I say and together we walk out onto the field where paniced people run passed us and a group stands in a group around someone laying down. We walk up to Scott in the group. I gasp as I look down. Tears run down my face as I look at Jackson, not breathing but bleeding with Lydia screaming. \"Oh god\" I whisper. \"Look\" Scott points out to Jackson\"s bloodly fingers. \"He did it himself?\" \"To get away from Gerard?\" My voice is a whimper. \"Mox, you crying?\" Scott asks. \"Shit! I.. I promised I\"d help him! I promised! Shit! Shit! He.. He must have thought I\"d given up on him. He must have thought his only friend didn\"t care anymore\" Isaac suddenly wraps his arms around my waist and pulls me close to him. I rest my head on his shoulder and feel Scott patt my back. \"Where\"s Stiles? Where\"s Stiles? Where the hell is my son?\" Is all I hear as Isaac tries to calm me down. \"Isaac I\"m pregnant\" I say into his shoulder. He freezes. I look up into his wide saucer like eyes. His month hanging open. I feel like I\"ve slapped him. He pushes me back slightly, he keeps one hand on my back and rests the other on my stomach. He stares at my stomach for a few minutes before looking back at me. So there\"s chapter 12 at last. Review and tell me what you think :) Thanks for following and faving me and reviewing my fanfic. Hope you enjoy this chapter :) Chapter 13 - Results. \"W-w-what do you mean your p-p-pregnant?\" He can barely get the words out of his mouth. \"Hey guys, maybe you two should talk about this in private\" Scott whispers to us. Sighing and seeming like the only calm person here at the moment grab Isaac\"s hand and nearly drag him to the guys locker room. He rushes to the sinks and splashes water on his face. Once, twice, three times. Wiping his wet face with his hands I see that its not the only thing rolling down his cheeks. \"Isaac, I mean pregnant. As in I\"m-having-your-kid pregnant\" \"B-b-but you can\"t b-b-be\" \"Well I am\" He turns around and looks into the sink. Is he going to be sick? Oh shit I\"m killing him. Or just freaking him out. \"I did this\" he whispers to himself, reminding me of the scared boy I saw when I saw him after his father beat him and invited him into my house. He turns around slowly and takes a while to reach my gaze. \"I\"m sorry Moxie, I should have been prepared. I really didn\"t want this for us, for you\" \"For me? Are you expecting me to raise your kid on me own?\" I snap angrily my Irish accent becoming husky. Isaac shakes his head and looks away from me. He can\"t even meet my gaze.", "\"We\"ll wait until someone reports the baby\"s parents disappearance\" \"Then what Rose?\" \"Then we call in saying we found a baby crying and say it was a double suidicide.\" \"Wow hopefully someone will think of something better\" Jacob says looking at the floor. Rosalie growls. Sadly she has nothing to hit Jacob with and fighting with him only upset Renesmee and Bella. \"What do we do until then?\" Esme asks. \"I\"ll take care of her\" Renesmee says, still looking down at the child. \"I promised her I would\" And with that the Cullens look shocked at their youngest. \"Nessie.. Its such a big responsibly.. Your too young\" \"Look Mom.. Its not so big if you\"ll be here helping me\" \"Maybe it wouldn\"t be a bad idea Bella.. It\"ll be a good chance for Nessie to prepare for the future\" Jacob says smiling. Edward growls. \"Keep those thoughts clean Jacob!\" \"But Nessie\"s only a child herself Edward\" \"Not really..\" Renesmee mutters. \"Look its my life , my choice.. I promised her\" Bella sighs. It would be a great experience and she won\"t be alone and surely it won\"t be for long. \"Alright Nessie\" Renesmee smiles and tickles the baby. The baby giggles happily in the warm embrace of her caregiver. Please tell me what you think. Heya guys, just letting you know I\"ll hardly be on fanfiction because I\"ve oved to wattpad because its easier. All my stories from my fanfiction account will be on my wattpad account. So see ya on the other side... XxParadiseLostxX (MY WATTPAD NAME) Geography seemed to go on forever. I tapped my desk impatiently, wanting the hands on the clock to reach half one so I can leave. Geography was my last class of the day and with the now heavy rain pounding on the large windows it seemed that my outfit for the day wasn\"t really my best choice. Stupid weather man. Sighing I turn to the empty seat beside me where Nessie usually sat. She told me that she and Jacob had decided that they would skip the day and shop for my birthday present, even though my birthdays not until Saturday. I played along with their lie knowing what they were really doing. Staying at home to face these Volturi. Whoever they were. I still have to meet Seth in the parking lott so we can go get this CD that I know won\"t be out for another couple of months. How stupid do my family think I am? Well I still have no plan on how I\"m going to meet this Volturi group or people or animals or whatever they are... The bell rings for school to finish and I nearly cry in relief, geography with Ms McGee was so boring, i\"ll never understand geography. As I get to my locker I manage to bump into Anna. Her books spill from her arms and onto the floor. \"Sorry Anna\" I say as I bend down to pick them up. \"Ah your grand\" She laughs with a smile. \"You alright? You look in a hurry\" \"I just want to go home.. thank god for the weekend\" \"God dont get me started.. looking forward to your date?\" \"It\"s not a date!\" \"Alright alright its not a date.. just two love birds getting together on a Saturday night\" \"Shut up! We are not love birds\" I say blushing. \"Sure sure\" she laughs again. \"I\"ll text you later.. wait can you do me a favour?\" I say as I hand her back her books. \"Yeah sure. What is it?\" \"I\"ll need to be picked up from somewhere later.. I\"ll text you when to come\" \"Yeah okay. See ya\" \"See ya\" Quickly I hurry to my locker. Taking out my Maths books and my art pad an idea comes to mind. What if I just tell Seth I don\"t feel well? No that won\"t work. What if I just run away from him like the chicken I am? It\"s all I got. Shaking my head I lock my locker and sigh as I walk down the hallway to the schools main entrance to the parking lott. Seth leans against the shiny black Honda. The rain has stopped thankfully. \"Ready to go?\" He asks smiling. \"Yeah\" \"I can\"t believe they didn\"t have it\" Seth repeats himself for the fourth time as I take a sip from my coke. I shrug, waiting for the right moment when I can slip away. \"It\"s not your fault\" \"I feel really bad for dragging you out here. How about I get the food?\" \"What Seth Clearwater is offering to get food?!\" I mock my shock and hold a hand to my heart. He rolls his eyes and gets up. \"Your usual?\" \"Double cheese burger with fries\" I say smiling. He walks off from our table at the food court over to the food counter. Now I make my escape. Grabbing my bag I check over to the food counter to where Seth still stands in the long line. Quickly I make my way through the crowd of shoppers and quickly text Anna. She can only drop me half way or they\"ll hear her car. Waiting outside of the shopping mall I tap the screen of my phone nervously. The guilt of leaving Seth like that made me feel kinda mean. He doesn\"t deserve to be ditched. It was nice of him to offer up his day to me, even if it was only to get me out of the house and away from the seemingly dangerous Volturi. The beeping of a nearby car pulls me from my thoughts. Anna waves from her car smiling happily. Nirvanna blasting through her car speakers. Running up to the cat I open the front door and slide in beside her. \"Where to?\" \"You know where that sign near my house?\" \"The speed 50 sign? That\"s like five miles from your house\" \"It\"s not five its less\" \"Yeah by what a mile? Why don\"t I just drop you by your house?\" \"My parents don\"t know I\"m out\" I lie. It\"s half true right? They know I\"m out but they don\"t know I\"m coming home early. \"Oooh rebel\" Anna says smiling. \"I never thought I saw the day\" I roll my eyes and listen to Nirvanna Smells Like Teen Spirit. \"Thanks Anna\" I say as I hope out of her car. \"No bother. See ya soon\" She drives away just as I start running through the wood lands that will bring me to my house. I\"ve always liked running. I run most Saturday mornings with Nessie but mostly I go on my own. I like to run on my own, to the cold breeze on my face and bare arms to the feeling of excitement and freedom it gives me. A black flash zooms by me with great speed causing me to stop and look for it. After not being able to see anything that matches the form I continue running, slowing down this time just in case I see it again. Again it zooms by me with even more speed behind it. \"What is that?\" I ask myself out load with the remaining bit of breath I had from running. Catching my breath I look around for it. I get a strange feeling of someone watching me. Looking around I notice I\"m near the clearing. Who or what\"s stalking me? \"Jacob? Sam? Leah?\" I call out incase its one of the wolves trying to scary me away. There\"s a dead silence for a few minutes. Nothing happening. \"I shouldn\"t freak myself out like that\" I mumble to myself before walking on. The faint little laughter causes a chill to run down my spine and my legs to go into full speed. Jumping over logs and racing by trees I don\"t even know what\"s after me until I stop running realising I\"m lost. \"Oh come on!' I rant in my mind bitterly and still full of fear. I try catch my breath and calm myself down. I can\"t stop the feeling that I\"m still being followed and that its by that girl from Orphan. The little crazy Russian girl has come to kill me. Oh why did I have to stay up late and watch that stupid movie. There vampires. You can tell by there blood red eyes. There\"s only two. There twins. A boy and a girl. There young about my age or younger but there eyes tell me there older than I think. \"Well well Jane, it appears we found little Gracey after all\" the boy in the pearl grey suit and black cloak says smirking as he walks towards me. \"Yes, all human and all alone. Your a far way from home\" Jane says smirking at her brother. I can only stare at them. Are these the dangerous Volturi? The ones that I\"m not even allowed to know about? My family really do think I\"m dumb. \"Your the Volturi?\" I whisper biting my lip. \"It speaks\" the boy says as he circles me and flicks my hair. \"I thought the Cullens told all their pets about us?\" Jane asks cocking an eyebrow. \"I\"m not a pet\" \"Oh? Then what are you?\" I shake my head. I don\"t like this. Something doesn\"t feel right. \"Aro will be so pleased to meet the Cullens new pet wouldn\"t he Jane?\" \"Yes, of coarse why dont you bring her? I know you haven\"t had as much fun as I these past couple of months\" Smirking at each other I raise an eyebrow and turn around, leaving their weird conversation. \"Where do you think your going?\" Jane snaps. As if with a click of her fingers pain courses through my veins and through my body. It feels like I\"ve been thrown into the pit of Hell and left to burn into ash. I can\"t help the scream that escapes my burning lips. I fall to the ground in an effort to try and stop the pain but nothing stops it. It\"s too hard to carry on screaming and thrashing, I\"ve tired myself out. But then as if a light at the end of the tunnel, the pain ceases and ceases until its stopped completely but something\"s wrong. I can\"t feel anything, I can\"t see or hear or smell the mossy ground below me. I can\"t even move. Blackness takes over before I know it. A/N like it? Hate it? Wanna beat me up for it? I don\"t know this chapter was hard to write. I\"m so sick that even my ears are pulsing in pain. I can hear my heart beat in my lips.. is that normal? Well anyway I\"m off to find some Nurofen. Those things are like magic. So comment, fan, vote and make this very sick authors day :) x Chapter 5 - The Volturi The numbing suddenly stops and for the first time In I don\"t know how long, I feel free and moble. Looking up at the strange ceiling I panic. This isn\"t my room. This isn\"t my house. Sitting up I nearly jump as the boy from the forest stares at me from the loveseat at the bottom of the bed. \"Where am I?\" I ask while looking around, not wanting to met his gaze. \"The Volturi castle. Aro will be so pleased that your awake\" \"Who\"s Aro? Who are you? What am I doing here? Why did you take me?\" \"You know curiosity killed the cat\" he replies. I turn to his smirking gaze. \"Yeah well satisfactory brought it back\" He raises an eyebrow at me. \"Who are you?\" I ask again. \"You know who I am. I should know who you are\" Before I can even breathe he has his hand around my neck and pushes me up against the wall. He nearly cuts off my breathing. \"No one. I am no one important to you nor will I ever be\" he growls in my face causing me to get a proper look at his face. He must be about fifteen with dark hair. I know all vampires are meant to be beautiful and trust me they all are but he just cuts the cake as Anna would say. Realising I can\"t breath he let\"s go of me, causing me to fall on the bed gasping for air. He stands straight and tall. \"Come, Aro wishes to speak to you\" He pulls me up, his cold hands seem to linger on my skin before he pushes me to move on out the door. \"I don\"t know where I\"m going\" I mutter, looking down as two vampires pass by looking at me curiously. \"Oh look Sulpicia its the Cullens little pet, Alec\"s singer\" I look to Alec with a questioning look before he pulls me away from the two vampires as another one comes running up behind them. \"Look Corin...\" I can\"t stop my blush as there voices fade. Alec. That\"s his name? I look up at him. Alec is very old fashioned. I wonder how old he is? \"I can\"t sing\" I tell him as we near two giant doors. He raises an eyebrow at me and shakes his head before opening the doors. \"Ah she\"s awake. Welcome Grace\" the soft voice calls to us. Alec begins to walk into the room so I follow him. He wasn\"t going to leave me standing at the door like a retard. The amount of people in the room makes me uncomfortable. I\"m not used to big crowds watching my every step. I can\"t help but blush in embarrassment. A man with long black hair and pink eyes meets us in the middle of the room leaving his chair. The other two men sitting in the other chairs look down at me curiously along with everyone else in the room. \"There has been such talk about you Grace. Please pardon my manners. My name is Aro, you must have heard of me from your family, the Cullens\" I shake my head. Aro was never mentioned. The Volturi was never mentioned until yesterday.. or two days ago? How long have I been here? \"Really.. interesting. May I?\" He extends his hand. Does he want to shake my hand? I hold out my hand and he takes it. His cold hands making me shiver in a bad way, a fearful way. \"Interesting.. interesting... It seems the Cullens have kept you in the dark about vampires other than themselves. Renesmee has turned out beautifully... Don\"t be shy darling Grace, there is no need\" I raise an eyebrow. What is he talking about? How did he know about what I know about Vampires? How could he know about Renesmee? \"I can see peoples memories with one touch darling Grace. Alec you must be more gentle with Grace, she is very fragile\" Aro warned smiling. From the corner of my eye I see Alec nod. The look on his face reminds me of the look he wore when the two women in the hallway called me Alec\"s singer. Aro began to laugh causing me to jump back and take my hand away. \"Oh Grace, how you amuse me. Your blood sings to Alec, not that way\" Wow thanks for clearing that up captain obvious. I still dont understand. But that isn\"t important now. I need to know when I\"m going home. Everyone\"s going to flip out. \"When can I go home?\" I ask quietly. I hate myself for being so socially awkward. I really do. \"Oh Grace, don\"t you understand?\" Aro asks as if I\"m slow and that I should know what\"s going on. \"Your something I want\" Me? Why does he want me? \"What?\" I ask. I must have missed something. \"Take her back to her room Alec, you shall be her guard until the time comes. Goodbye Grace, we shall talk soon\" Aro begins to walk back to his throne chair as Alec grabs my arm and pushes me forward and out of the room. Ingoring the stares and glares as we walk out of the room it all clicks. There not going to let me go home. There going to do something bad to me. Alec let\"s go of me which I take as my cue to leave. Gathering all my speed I try to run away from him and look for a way out. But not before cold arms wrap around my waist and pull me back, smashing my back into their hard stone chest. \"No! You can\"t make me stay here! Let me go!\" I scream struggling. \"Stop that now Grace. Don\"t you realise that it doesn\"t matter if you alive or dead? Do you want to die now?\" He snarls in my ear. I stop struggling and hang my head as he flits back to the room before I try to run off again. It\"s over, as long as I\"m here I\"m officially dead. Chapter 6 Alec opens the door to the room I had woken up in and shoves me in. I glare at him hatefully as I sit on the bed and wrap my arms around my legs. Alec just leans against the wall, watching me, as if I\"m going to explode at any minute. \"What do you people want with me? What am I to you?\" I ask boldly, which is really uncommon for me. \"Aro wants you. Not I nor the guard. Did the Cullens teach you anything? Do you not read?\" \"Why does he want me?\" \"That would be telling\" Sighing I lay back on the bed. \"I don\"t understand why he wants me. I\"m not like you. I\"m human. I\"m a nobody compared to everyone else. I\"m not even biologically related to them.. why am I here?\" I ask myself more than him as I try to figure it out. \"Your bait\" With that I hear the door slamming. Sitting up I look to the shut door and the now empty room. Bait? Bait for what? Laying on my side on the comfortable bed I close my eyes to concentrate. Ma must be going out of her mind. Seth is properly going to be put on trail. Everyone is going to be so worried. Why couldn\"t I have just let Anna drive me all the way home? Why couldn\"t I have just stayed with Seth at the mall? Why am I such an idiot? Why do I have to be so alone in this.. wait a minute. Quickly getting off the bed I move towards the door. Taking a deep breath I open the door slowly. A plan alreadying formulating in my mind. They can\"t keep me here. The sounds of sharp footsteps come from somewhere far off and distance. I can\"t go through the door, someone will see me and defiantly know I\"m trying to escape. Looking to the window, a jolt of fear runs through me. Opening the curtains to the bright sun I stare down at the distance from me to the ground below. It doesn\"t seem that far but I could still fall.. What am I saying? Do I want to stay here and be used as baite to bring my family here? Stupid brain. As I watch masses of people flood by the building I sigh. I can\"t leave now or it\"ll cause a riot. Leaving the curtains open to let some sunshine into the room I sit back on the bed. If I can make it till midnight Chapter Seven. It must be able half ten when my door opens again. Jane walks in, a silver tray in her pale hands. I stare up at her from my laying position on the bed. My eyes have been on the door the past couple of hours. Vampires can be silent. What would stop one blood thirsty one from coming in and killing me while I was looking out the window. \"Aro would like to know if you want anything else? It also apologises for the delay on dinner. Important meetings come before less important meals\" I just stare at her with her dead cold ruby eyes. \"I can tell you haven\"t died from your breathing, answer me mortal\" I continue to stare, hoping she\"ll go away. In all the very few Volturi members I\"ve met so far here she would have to be the worst. I\"d rather Alec choking me again. And believe me, that was not a pleasurable experience. She raises a light coloured eyebrow and turns to walk away. \"Sheets, I\"d like more sheets please\" She turns around again to me and with the same raised eyebrow and now suspicious eyes she watches me, wondering about my strange request. \"I.. I get really cold at night\" I say blushing slightly at my outright lie. \"I\"ll get Alec or Felix to bring them to you\" she says as she turns around again and this time walks out of the room. I don\"t breath a sigh of relief for about 20 minutes, incase she was nearby and heard it. Hopefully they\"ll bring enough sheets, I\"d need a lot if I\"m going to get out. I\"m half asleep by the time someone arrives at my door again. The knocking wakes me up. Slowly I get up and watch the door for a few seconds. I know I haven\"t been here long but I know that if it was Alec then he wouldn\"t have knocked. He would have rudely walked in and slammed the door after him, noting me of his presence. Who did Jane say she would send instead of Alec? She said a name.. Cautiously I walk up to the door and open it. The first thing I\"m met with is a huge box held with huge rough looking pale hands. I look up further to the tall, extremely well built man with black hair and ruby red eyes, the same as everyone else around here but two things stand out that both surprise and shock me. The smile on his face, not a pervy sort but one of rainbows and happiness. The other was how much he reminded me of Da.. I can feel my eyes widening. I don\"t know if I should be relieved or absolutely terrified. \"Got the sheets you ordered\" He holds out the box, reminding me of his whole purpose to my door. I open the door wider, my wide eyes still on him as I move for him to walk in. He walks passed me. Oh god he even walks like Dad. I watch him in disbelief as he places the box on the bed and turns to smile at me. \"Something up kid? You\"ve been staring at me like that for two minutes. I\"m not going to go over and attack you.. well.. don\"t provoke me\" he winks at me with that smile. I shake my head and look to him again. Even his presence reminds me of Da. The happy, friendly ora surrounds him. I manage a small smile and a nod at him. \"I know this is rough for ya kid but just think it\"ll be over soon\" I nod and stare at him, the small smile still on my face as I try to find any other things that remind me of Da. \"Who are you?\" I ask, my voice more of a whisper than actually my full tone. \"My name is Felix, I enjoy sunsets, long walks on the beach and frisky women\" I laugh as I close the door. \"Thought you said your name was Felix and not Dean Winchester\" \"I\"ve got a good few identities.. Dean on Wednesdays, Thursdays I\"m a teddy bear doctor, weekends I\"m Barman and everyother day I\"m this incredibly awesome guy\" I roll my eyes and laugh. \"Any secret identities I should know about?\" He asks. \"Nope I\"m Grace.. as I\"m Grace all days of the week\" \"Pretty boring but I can get that blood pumping in those veins\" My smile drops and I look at him with a slight look of fear. \"Too soon?\" He asks looking apologetic. I nod and pull a strain smile. \"I\"ll leave before I say something else, see ya later kid\" he says as he walks past me. \"Oh and eat something. The wives spent a lot of time trying to make something that you\"d like\" He closes the door after him as he leaves. My eyes go to the silver tray that Jane had placed on the cream dresser. Picking up a roll I stare at the soup in the bowl. I guess that\"s one way to go in guessing what people like to eat. It won\"t matter though, I won\"t be here long anyways. Chapter Eight - Stab My Back. It must be around midnight when the streets become very dark and quiet. Nobody is out walking as far as I can tell. Pulling on the long knotted sheets that I had tied together from the sheets Felix brought me I exhale deeply. I can\"t believe it. For vampires they\"re not very smart."]}